JohnDMcMaster/open-tl866/firmware/modes/programmer/at89/main.c
#include <xc.h>

#include "../../../stock_compat.h"
#include "../../../mode.h"
#include "../../../comlib.h"
#include "../../../arglib.h"
#include "../../../io.h"
#include "../../../system.h"


#define ZIFMASK_XTAL1 4;
#define ZIFMASK_GND 8;
#define ZIFMASK_VDD 128;
#define ZIFMASK_VPP 64;
#define ZIFMASK_PROG 32;

static zif_bits_t zbits_null = {0, 0, 0, 0, 0};
static zif_bits_t gnd        = {0, 0, 0x8, 0, 0};
static zif_bits_t vdd        = {0, 0, 0, 0, 0x80};
static zif_bits_t vpp        = {0, 0, 0, 0x40, 0};

static inline void print_help(void)
{
    com_println("open-tl866 (at89)");
    com_println("r addr range   Read from target");
    com_println("w addr data    Write to target");
    com_println("R addr         Read sysflash from target");
    com_println("e              Erase target");
    com_println("l mode         Set lock bits to MODE (2, 3, 4)");
    com_println("s              Print signature bytes");
    com_println("B              Blank check");
    com_println("T              Run some tests");
    com_println("h              Print help");
    com_println("v              Reset VDD");
    com_println("V              Print version(s)");
    com_println("L val          LED on/off (LED_ON/LED_OFF)");
    com_println("b              reset to bootloader");
    com_println("addr, range in hex");
}

// Neat trick taken from a stack overflow answer.
static inline unsigned char invert_bit_endianness(unsigned char byte)
{
    static unsigned char lookup[16] = {
                            0x0, 0x8, 0x4, 0xc, 0x2, 0xa, 0x6, 0xe,
                            0x1, 0x9, 0x5, 0xd, 0x3, 0xb, 0x7, 0xf, };
    return (lookup[byte & 0b1111] << 4) | lookup[byte >> 4];
}

static inline void mask_p2_7(zif_bits_t op_base)
{
    op_base[3] |= 0x8;
}

static inline void mask_p3_6(zif_bits_t op_base)
{
    op_base[1] |= 0x80;
}

static inline void mask_p3_7(zif_bits_t op_base)
{
    op_base[2] |= 0x1;
}

/*
static inline void mask_xtal1(zif_bits_t op_base)
{
    op_base[2] |= 0x4;
}
*/

static inline void mask_prog(zif_bits_t op_base)
{
    op_base[3] |= 0x20;
}

static inline void mask_addr(zif_bits_t op_base, unsigned int addr)
{
    op_base[0] = addr & 0xFF;
    op_base[2] |= (addr >> 8) << 4;
}

static inline void mask_data(zif_bits_t op_base, unsigned char data)
{
    op_base[3] |= (data & 0x80);
    op_base[4] |= (invert_bit_endianness(data & 0x7f) >> 1);
}

static inline unsigned char zif_to_data(zif_bits_t zif_state)
{
    // Filter the zif_bits response into a char byte with P0 bits
                   // Trim non-data ZIF pins    // Set the LSB of data byte
    unsigned char byte = (zif_state[4] << 1) | !! (zif_state[3] & (1 << 7));

    // Invert bit-endianness
    return invert_bit_endianness(byte);
}

// Flip clock pin directly from TL866
static inline void pin_flip_clock()
{
    PORTE ^= 0x4;
}

/*
static inline void print_zif_state(zif_bits_t op)
{
    com_println("");
    com_println("01-08 09-16 17-24 25-32 33-40");
    for (unsigned char i = 0; i < 5; i++) {
        printf("%02X    ", op[i]);
    }
    com_println("");
}
*/

static inline void clock_write(zif_bits_t op, unsigned int cycles)
{
    zif_write(op);
    for(unsigned int i = 0; i <= cycles; i++) {
        pin_flip_clock();
        __delay_us(1);
        pin_flip_clock();
        __delay_us(1);
    }
}

/*
// Very slow, but useful for prototyping when other
// pins need to be changed alongside the clock
static inline void zif_clock_write(zif_bits_t op_template, zif_bits_t op_clk,
                            unsigned int cycles
                            )
{
    for(unsigned char i = 0; i <= cycles; i++) {
        zif_write(op_template);
        zif_write(op_clk);
    }
}
*/

static unsigned char read_byte(unsigned int addr)
{
    /* 
     * AT89C51 Read Pinout:
     * 
     * Target   Dir     ZIF pin#    Programmer port
     * ------------------------------------------------------------------------
     * RST      <-      09          RJ4                     // (high)
     * PSEN     <-      29          RD7                     // (low)
     * PROG     <-      30          RG0                     // (high)
     * VPP      <-      31          RJ0                     // (high)
     * VCC      <-      40          Vdd_40
     * P0.{0-7) ->      39-32       RB{6,5,4,3,2}, RJ{3,2,1}      // PGM Data
     * P1.{0-7} <-      1-8         RC{5,4,3,2}, RJ{7,6}, RC{6,7} // Addr
     * P2.{0-3} <-      21-24       RE{4,5,6,1}             // Addr (contd.)
     * P2.6     <-      27          RD5                     // ctrl (low)
     * P2.7     <-      28          RD6                     // ctrl (low)
     * P3.4     ->      14          RD1                     // Busy
     * P3.6     <-      16          RG1                     // ctrl (high)
     * P3.7     <-      17          RE0                     // ctrl (high)
     */
    
    // Set pin direction
    zif_bits_t dir = {  0,
                        0b00100000,   // Busy signal (14)
                        0,
                        0b10000000,   // p0.7 (32)
                        0b01111111 }; // p0.{6-0} (33-39)  
    dir_write(dir);
    
    // Set Vdd / GND pinout  
    set_vdd(vdd);
    set_gnd(gnd);
    
    // Set voltages
    vdd_val(5); // 5.0 v - 5.2 v

    // Allocate an empty zifbits struct for reading pin state
    zif_bits_t response    = { 0, 0, 0, 0, 0 };

    // Base pin setting for reading
    zif_bits_t read_base = { 0b00000000,
                             0b10000001,   // 3.6 ctrl (16), RST (9)
                             0b00000001,   // 3.7 ctrl (17) 
                             0b01100000,   // VPP (31), PROG (30)
                             0b00000000 };

    zif_bits_t read_clk;

    // Mask in the address bits to the appropriate pins
    mask_addr(read_base, addr);

    // Give the clock on/off states to zif_clock_write(..) and loop 48 cycles
    clock_write(read_base, 48);

    // Read the current pin state (to read in the requested byte)
    zif_read(response);

    // We're done with the byte. Turn off all outputs.
    zif_write(zbits_null);

    return zif_to_data(response);
}

static void read(unsigned int addr, unsigned int range)
{    
    printf("%03X", addr);

    for (unsigned int byte_idx = 0; byte_idx < range; byte_idx++) {
        printf(" %02X", read_byte(addr + byte_idx));
    }
    printf("\r\n");
}

static void write(unsigned int addr, unsigned char data)
{
    /* 
     * AT89C51 write Pinout:
     * 
     * Target   Dir     ZIF pin#    Programmer port
     * ------------------------------------------------------------------------
     * RST      <-      09          RJ4                     // (high)
     * PSEN     <-      29          RD7                     // (low)
     * PRO      <-      30          RG0                     // Pulsed prog.
     * VPP      <-      31          VPP_31                  // 12v
     * VCC      <-      40          Vdd_40
     * P0.{0-7) <-      39-32       RB{6,5,4,3,2}, RJ{3,2,1}      // PGM Data
     * P1.{0-7} <-      1-8         RC{5,4,3,2}, RJ{7,6}, RC{6,7} // Addr
     * P2.{0-3} <-      21-24       RE{4,5,6,1}             // Addr (contd.)
     * P2.6     <-      27          RD5                     // ctrl (low)
     * P2.7     <-      28          RD6                     // ctrl (high)
     * P3.4     ->      14          RD1                     // Busy
     * P3.6     <-      16          RG1                     // ctrl (high)
     * P3.7     <-      17          RE0                     // ctrl (high)
     */
    
