JohnDMcMaster/open-tl866/firmware/modes/programmer/at89/main.c
    printf("Writing %02X at %03X... ", data, addr);

    // Set pin direction
    zif_bits_t dir = {  0,
                        0b00100000,   // Busy signal (14)
                        0, 0, 0 };
    dir_write(dir);
    
    // Set pins
    set_vdd(vdd);
    set_vpp(vpp);
    set_gnd(gnd);
    
    // Set voltages
    vdd_val(5); // 5.0 v - 5.2 v
    vpp_val(1); // 12.8 v - 13.2 v

    // Base pin setting for writing
    zif_bits_t write_base = { 0b00000000,
                              0b10000001,   // 3.6 ctrl (16), RST (9)
                              0b00000001,   // 3.7 ctrl (17) 
                              0b01001000,   // VPP (31), 2.7 (28)
                              0b00000000 };
    
    // Mask in our address and data outputs to the base pin configuration
    mask_addr(write_base, addr);
    mask_data(write_base, data);
    
    // Create a zif state to set before running the clock
    // PROG needs to be pulsed, can't be kept low the entire time.
    zif_bits_t write_preclk;
    memcpy(write_preclk, write_base, 5);
    mask_prog(write_preclk);
   
    // Enable VPP right before setting the ZIF state
    vpp_en();

    // Set PROG high before pulsing it low during programming
    zif_write(write_preclk);
    __delay_us(20); // 20us might be too generous. TODO

    clock_write(write_base, 48);

    // We're done. Disable VPP and reset the ZIF state.
    vpp_dis();
    zif_write(zbits_null);
    
    // The client / user is expected to verify this with a read command.
    printf("done.\r\n");
}

static void erase()
{
    /* 
     * AT89C51 erase Pinout:
     * 
     * Target   Dir     ZIF pin#    Programmer port
     * ------------------------------------------------------------------------
     * RST      <-      09          RJ4                     // (high)
     * PSEN     <-      29          RD7                     // (low)
     * ALE      <-      30          RG0                     // Pulsed erase
     * VPP      <-      31          VPP_31                  // 12v
     * VCC      <-      40          Vdd_40
     * P2.6     <-      27          RD5                     // ctrl (high)
     * P2.7     <-      28          RD6                     // ctrl (low)
     * P3.4     ->      14          RD1                     // Busy
     * P3.6     <-      16          RG1                     // ctrl (low)
     * P3.7     <-      17          RE0                     // ctrl (low)
     */
    
    printf("Erasing... ");
    
    zif_bits_t dir = {  0,
                        0b00100000,   // Busy signal (14)
                        0, 0, 0 };
    
    // Set pin direction
    dir_write(dir);
    
    // Set pins
    set_vdd(vdd);
    set_vpp(vpp);
    set_gnd(gnd);
    
    // Set voltages
    vdd_val(5); // 5.0 v - 5.2 v
    vpp_val(1); // 12.8 - 13.2
    
    // Base pin setting for erasing
    zif_bits_t erase_base =     {       0b00000000,
                                        0b00000001, // RST (9)
                                        0b00000000,  
                                        0b01000100, // VPP (31), 2.6 (27)
                                        0b00000000 };

    // Create a zif state to set before running the clock
    // PROG needs to be pulsed, can't be kept low the entire time.
    zif_bits_t erase_preclk;
    memcpy(erase_preclk, erase_base, 5);
    mask_prog(erase_preclk);
    
    // Enable VPP right before setting the ZIF state
    vpp_en();
    
    // Set PROG high before pulsing it low during erase
    zif_write(erase_preclk);
    __delay_ms(20);
    
    clock_write(erase_base, 48);
    
    // Erase function requires 10ms prog pulse
    __delay_ms(10);
    
    // We're done. Disable VPP and reset the ZIF state.
    vpp_dis();
    zif_write(zbits_null);
    
    // The client / user is expected to verify this with a read command
    // or a blank check command (TODO)
    printf("done.\r\n");
}

static void lock(unsigned char mode)
{
    /* 
     * AT89C51 lock (modes 2, 3, 4) Pinout:
     * 
     * Target   Dir     ZIF pin#    Programmer port
     * ------------------------------------------------------------------------
     * RST      <-      09          RJ4                 // (high)
     * PSEN     <-      29          RD7                 // (low)
     * ALE      <-      30          RG0                 // Pulsed write lock
     * VPP      <-      31          VPP_31              // 12v
     * VCC      <-      40          Vdd_40
     * P2.6     <-      27          RD5                 // ctrl (high)
     * P2.7     <-      28          RD6                 // ctrl (2:h, 3:h, 4:l)
     * P3.4     ->      14          RD1                 // Busy
     * P3.6     <-      16          RG1                 // ctrl (2:h, 3:l, 4:h)
     * P3.7     <-      17          RE0                 // ctrl (2:h, 3:l, 4:l)
     */
    
    printf("Locking with mode %u... ", mode);
    
    // Base pin setting for erasing
    zif_bits_t lock_1 = { 0b00000000,
                             0b00000001, // RST (9)
                             0b00000000,  
                             0b01000000, // VPP (31)
                             0b00000000 };

    zif_bits_t lock_2 = { 0b00000000,
                             0b00000001, // RST (9)
                             0b00000000,  
                             0b01000100, // VPP (31), 2.6 (27)
                             0b00000000 };

    zif_bits_t lock_3 = { 0b00000000,
                             0b00000001, // RST (9)
                             0b00000000,  
                             0b01000100, // VPP (31), 2.6 (27)
                             0b00000000 };
    
    zif_bits_t dir = {  0,
                        0b00100000,   // Busy signal (14)
                        0, 0, 0 };


    mask_prog(lock_1);

    mask_p2_7(lock_2);
    mask_p3_6(lock_2);
    mask_p3_7(lock_2);

