JohnDMcMaster/open-tl866/firmware/modes/programmer/at89/main.c
    switch (mode) {
        case 2:
            printf("2\r\n");
            mask_p2_7(lock_3);
            mask_p3_6(lock_3);
            mask_p3_7(lock_3);
            break;
        case 3:
            printf("3\r\n");
            mask_p2_7(lock_3);
            break;
        case 4:
            printf("4\r\n");
            mask_p3_6(lock_3);
            break;
        default:
            printf("Invalid mode %u. Valid modes are 2, 3 or 4\r\n", mode);
            return;
    }

    // Making a pulsed lock_2
    zif_bits_t lock_2_proglow;
    memcpy(lock_2_proglow, lock_2, 5);
    mask_prog(lock_2);

    // Making a pulsed lock_3
    zif_bits_t lock_3_proglow;
    memcpy(lock_3_proglow, lock_3, 5);
    mask_prog(lock_3);

    // Set pin direction
    dir_write(dir);
    
    // Set pins
    set_vdd(vdd);
    set_vpp(vpp);
    set_gnd(gnd);
    
    // Set voltages
    vdd_val(5); // 5.0 v - 5.2 v
    vpp_val(1); // 12.8 - 13.2

    
    // Enable VPP right before setting the ZIF state
    vpp_en();
   
    // Using clock_write(...) results in some inconsistency, and being unable
    // to set pins while the clock is running makes it rather unflexible.
    // Working around this limitation by making multiple calls to clock_write
    // results in gaps on the clock line while writing to sreg with the new pin
    // state. This happens to hinder the following algorithm, so the clock here
    // will be driven by the PIC18F87J50 PWM module as described in sections
    // 17.4, 18.1 and 18.4 of the datasheet. Eventually this should be a
    // drop-in replacement function for clock_write(...)

    // Enable PWM clock. 
    CCP2CON = 0b10001100;
    TRISEbits.RE2 = 0;
    T2CON = 0b00000100;
    PR2 = 249;
    CCPR1L = 125;

    zif_write(lock_1);
    __delay_ms(400);

    zif_write(lock_2);
    __delay_ms(1);

    zif_write(lock_2_proglow);
    __delay_ms(1);

    zif_write(lock_2);
    __delay_ms(400);

    zif_write(lock_3);
    __delay_ms(1);

    zif_write(lock_3_proglow);
    __delay_ms(1);

    zif_write(lock_3);
    __delay_ms(400);
    
    T2CON = 0;     // Enable TMR2 with prescaler = 1
    CCP2CON = 0;   // Disable PWM on CCP1

    ///////////////////////////////////////////////////////////////////////////

    // We're done. Disable VPP and reset the ZIF state.
    vpp_dis();
    zif_write(zbits_null);
    
    // The client / user is expected to verify this with a read command
    // or a blank check command. A slight timing invariance could also be used
    // to discern blank and protected chips. (TODO)
    printf("done.\r\n");
}

static unsigned char read_sysflash(unsigned int offset)
{
   // TODO. Implements the signature reading routine as described in the
   // datasheet. Would be a good precheck before doign read/write/erase ops.
    
     /* 
     * AT89C51 Read Signature Pinout:
     * 
     * Target   Dir     ZIF pin#    Programmer port
     * ------------------------------------------------------------------------
     * RST      <-      09          RJ4                     // (high)
     * PSEN     <-      29          RD7                     // (low)
     * PROG     <-      30          RG0                     // (high)
     * VPP      <-      31          RJ0                     // (high)
     * VCC      <-      40          Vdd_40
     * P0.{0-7) ->      39-32       RB{6,5,4,3,2}, RJ{3,2,1}      // PGM Data
     * P1.{0-7} <-      1-8         RC{5,4,3,2}, RJ{7,6}, RC{6,7} // Addr
     * P2.{0-3} <-      21-24       RE{4,5,6,1}             // Addr (contd.)
     * P2.6     <-      27          RD5                     // ctrl (low)
     * P2.7     <-      28          RD6                     // ctrl (low)
     * P3.4     ->      14          RD1                     // Busy
     * P3.6     <-      16          RG1                     // ctrl (low)
     * P3.7     <-      17          RE0                     // ctrl (low)
     */
    
    // Set pin direction
    zif_bits_t dir = {  0,
                        0b00100000,   // Busy signal (14)
                        0,
                        0b10000000,   // p0.7 (32)
                        0b01111111 }; // p0.{6-0} (33-39)  
    dir_write(dir);
    
    // Set Vdd / GND pinout  
    set_vdd(vdd);
    set_gnd(gnd);
    
    // Set voltages
    vdd_val(5); // 5.0 v - 5.2 v
    
    // Allocate an empty zifbits struct for reading pin state
    zif_bits_t response  = { 0, 0, 0, 0, 0 };

    // Base pin setting for reading
    zif_bits_t signature_base = { 0b00000000,
                             0b00000001,   // RST (9)
                             0b00000000,
                             0b01100000,   // VPP (31), PROG (30)
                             0b00000000 };

    zif_bits_t signature_clk;
    
    // Mask in the address bits to the appropriate pins
    mask_addr(signature_base, offset);

    // Give the clock on/off states to zif_clock_write(..) and loop 48 cycles
    clock_write(signature_base, 48);

    // Read the current pin state (to read in the requested byte)
    zif_read(response);

    // We're done with the byte. Turn off all outputs.
    zif_write(zbits_null);
    
    return zif_to_data(response);
}

static unsigned char read_sig(unsigned int offset)
{
    return read_sysflash(0x30 + offset);
}

static void print_sysflash(unsigned int addr, unsigned int range)
{    
    printf("%03X ", addr);

    
    if (!range) { range = 1; } else {com_println("");}
    for (unsigned int byte_idx = 0; byte_idx < range; byte_idx++) {
        printf("%02X ", read_sysflash(addr + byte_idx));
    }
    printf("\r\n");
}

static bool sig_check()
{
    if (read_sig(0) == 0x1E && read_sig(1) == 0x51 && read_sig(2) == 0xFF) {
        return true;
    }

    printf("Could not detect an AT89C51. Ignoring command.\r\n");
    printf("Please make sure the target is inserted in the correct orientation.\r\n");
    return false;
}

static bool blank_check()
{
    //Update address in place by using backspace
    printf("Performing a blank-check... ");
    unsigned char data = 0;
    for (unsigned int addr = 0; addr < 0xFFF; addr++) {
        printf("%03X", addr);
        data = read_byte(addr);
        printf("\b\b\b");
        if (data != 0xFF) {
            printf("done\r\n");
            printf("%03X set to byte %02X\r\n", addr, data);
            printf("Result: not blank\r\n");
            return false;
        }
    }
    printf("done\r\n");
    printf("Result: blank\r\n");
    return true;
}

static void self_test()
{
    printf("Testing first 255 bytes...\r\n");
    erase();
    com_println("");
    for(unsigned int addr = 0; addr < 0xff; addr++) {
        write(addr, addr);
        com_println("");
    }
    read(0,0xFF);
    printf("Testing last 255 bytes...\r\n");
    for(unsigned int addr = 0xF00; addr <= 0xFFF; addr++) {
        write(addr, addr - 0xF00);
        com_println("");
    }
    read(0xF00, 0xFF);
    printf("\r\nTesting last byte...\r\n");
    write(0xFFF, 0);
    com_println("");
    read(0xFFF, 1);
    printf("\r\ndone.\r\n");
}

static void print_sig(void)
{
    uint8_t sig0 = read_sig(0);
    uint8_t sig1 = read_sig(1);
    uint8_t sig2 = read_sig(2);

    printf("(0x30) Manufacturer: %02X\r\n", sig0);
    printf("(0x31) Model:        %02X\r\n", sig1);
    printf("(0x32) VPP Voltage:  %02X\r\n", sig2);

