JohnDMcMaster/open-tl866/firmware/modes/programmer/at89/main.c
    uint32_t sig = (((uint32_t)sig0) << 16) | (sig1 << 8) | (sig2 << 0);
    const char *name;
    switch (sig) {
    case 0x0151FF:  name = "AT89C51 (19651)"; break;
    case 0x1E51FF:  name = "AT89C51 (19052)"; break;
    case 0x1EFF1E:  name = "AT89C51RC"; break;
    case 0x1E52FF:  name = "AT89C52 (19652)"; break;
    default:        name = "unknown";
    }
    printf("Name: %s\r\n", name);
}

static inline void eval_command(char *cmd)
{
    unsigned char *cmd_t = strtok(cmd, " ");

    if (cmd_t == NULL) {
        return;
    }

    switch (cmd_t[0]) {
    case 'r':
    {
        if (!sig_check()) {
            break;
        }
        
        unsigned int addr  = xtoi(strtok(NULL, " "));
        unsigned int range = xtoi(strtok(NULL, " "));
        read(addr, range);
        break;
    }
        
    case 'w':
    {
        if (!sig_check()) {
            break;
        }
        
        unsigned int addr  = xtoi(strtok(NULL, " "));
        unsigned char data = xtoi(strtok(NULL, " "));
        write(addr, data);
        break;
    }

    case 'R':
    {
        if (!sig_check()) {
            break;
        }
        
        unsigned int addr  = xtoi(strtok(NULL, " "));
        unsigned int range = xtoi(strtok(NULL, " "));
        print_sysflash(addr, range);
        break;
    }

    case 'l':
    {
        if (!sig_check()) {
            break;
        }
        
        unsigned char mode = atoi(strtok(NULL, " "));
        lock(mode);
        break;
    }
        
    case 'e':
        if (!sig_check()) {
            break;
        }
        
        erase();
        break;

    case 's':
        print_sig();
        break;
        
    case 'T':
        if (!sig_check()) {
            break;
        }
        
        self_test();
        break;
        
    case 'B':
        if (!sig_check()) {
            break;
        }
        
        blank_check();
        break;

    case 'v':
        printf("Reseting Vdd... ");
        vdd_dis();
        vdd_en();
        read_sig(0);
        printf("done.\r\n");
        break;

    case '?':
    case 'h':
        print_help();
        break;

    //LED on/off
    case 'L':
    {
        if (arg_bit()) {
            LED = last_bit;
        }
        break;
    }

    case 'b':
        stock_reset_to_bootloader();
        break;

    default:
        printf("ERROR: unknown command 0x%02X (%c)\r\n", cmd_t[0], cmd_t[0]);
        break;
    }
}

void mode_main(void) {
    vpp_dis();
    
     while(1) {
        eval_command(com_cmd_prompt());
    }
}
